//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Exécution de l'étape %d sur %d : création du magasin d'entités";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Exécution de l'étape %d sur %d : création d'une base de données Bootstrap";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Exécution de l'étape %d sur %d : création d'une base de données de file d'attente de demandes";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Exécution de l'étape %d sur %d : téléchargement du magasin d'entités. %s octets reçus sur %s pour l'instant.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Exécution de l'étape %d sur %d : effacement des demandes expirées";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Exécution de l'étape %d sur %d : chargement des métadonnées";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Exécution de l'étape %d sur %d : réalisation de la fusion d'une file d'attente de demandes";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Exécution de l'étape %d sur %d : réalisation de la fusion d'une transaction";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Exécution de l'étape %d sur %d : réalisation de la fusion d'une suppression de création";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Exécution de l'étape %d sur %d : traitement de la définition des requêtes %s à l'aide de %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Exécution de l'étape %d sur %d : traitement des demandes. Envoi de la demande de modification %s sur %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Exécution de l'étape %d sur %d : nouvelle application des modifications";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Exécution de l'étape %d sur %d : analyse des données reçues";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Exécution de l'étape %d sur %d : réception de données depuis le serveur. %s octets reçus pour l'instant.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Exécution de l'étape %d sur %d : suppression des relations supprimées";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Exécution de l'étape %d sur %d : suppression des demandes marquées comme RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Exécution de l'étape %d sur %d : envoi de données vers le serveur. %s octets envoyés pour l'instant.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Exécution de l'étape %d sur %d : envoi de la base de données du magasin d'entités. %s octets envoyés sur %s pour l'instant.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Exécution de l'étape %d sur %d : envoi de la base de données de file d'attente de demandes. %s octets envoyés sur %s pour l'instant.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Exécution de l'étape %d sur %d : début de la communication avec le serveur";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Exécution de l'étape %d sur %d : pré-traitement des demandes avant le chargement";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Exécution de l'étape %d sur %d : téléchargement en attente";

